      * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *
      * THIS PROGRAM DEMONSTRATES SOME OF THE BUILT IN COBOL FUNCTIONS
      * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *

       IDENTIFICATION DIVISION.
       PROGRAM-ID. COBFUNC.

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-NUM-VAL PIC 9(6) VALUE 0.
       01 WS-VALUES-TABLE.
          05 WS-VALUES PIC 9(02) OCCURS 6.

       PROCEDURE DIVISION.
      * CONVERT TO UPPERCASE
           DISPLAY FUNCTION UPPER-CASE ("abc xyz").
      * CONVERT TO LOWERCASE
           DISPLAY FUNCTION LOWER-CASE ("ABC XYZ").
      * GET LENGTH OF STRING
           DISPLAY FUNCTION LENGTH ("ABC XYZ").
      * REVERSE A STRING
           DISPLAY FUNCTION REVERSE ("ABC XYZ").
      * CONVERT NUMERIC EDITED TO NUMERIC FIELD USE NUMVAL-C
           COMPUTE WS-NUM-VAL =  FUNCTION NUMVAL-C("$123.50").
           DISPLAY "$123.50 CONVERTED : " WS-NUM-VAL.
      * CONVERT NUMERIC EDITED TO NUMERIC FIELD
           COMPUTE WS-NUM-VAL = FUNCTION NUMVAL-C ("£123.50").
           DISPLAY "£123.50 CONVERTED : " WS-NUM-VAL.
      * CONVERT ALPHANUMERIC FIELD TO NUMERIC FIELD. USE NUMVAL
           COMPUTE WS-NUM-VAL = FUNCTION NUMVAL("123456").
           DISPLAY "123456 CONVERTED : " WS-NUM-VAL.
      * FIND MAX VALUE USING ALL OPTION
           MOVE "059102984527" TO WS-VALUES-TABLE.
           COMPUTE WS-NUM-VAL = FUNCTION MAX (WS-VALUES(ALL)).
           DISPLAY "MAX VALUE : " WS-NUM-VAL.
      * ROUND AND RETURN INTEGER VALUE
           COMPUTE WS-NUM-VAL = FUNCTION INTEGER (123.4).
           DISPLAY "INTEGER OF 123.4 : " WS-NUM-VAL.
      * ROUND A VALUE 
           COMPUTE WS-NUM-VAL ROUNDED = 123.8.
           DISPLAY "VALUE OF 123.8 ROUNDED : " WS-NUM-VAL.
      * GET REMAINDER. BELOW FUNCTION WILL RETURN 6 
           COMPUTE WS-NUM-VAL = FUNCTION REM (56, 10).
           DISPLAY "56 DIVIDED BY 10 REMAINDER : " WS-NUM-VAL.
      * GET CURRENT TIMESTAMP
           DISPLAY "CURRET DATE: "  FUNCTION CURRENT-DATE.

           STOP RUN.
       
       